{
  "architectures": [
    "RobertaModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 32,
  "initializer_range": 0.02,
  "intermediate_size": 128,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 16,
  "model_type": "roberta",
  "num_attention_heads": 4,
  "num_hidden_layers": 2,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.55.4",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 1000,
  "rknn": {
    "model_b1_s16.rknn": {
      "rktransformers_version": "0.2.0",
      "model_input_names": [
        "input_ids",
        "attention_mask"
      ],
      "batch_size": 1,
      "max_seq_length": 16,
      "task_kwargs": null,
      "float_dtype": "float16",
      "target_platform": "rk3588",
      "single_core_mode": false,
      "mean_values": null,
      "std_values": null,
      "custom_string": null,
      "inputs_yuv_fmt": null,
      "dynamic_input": null,
      "opset": 19,
      "task": "auto",
      "quantization": {
        "do_quantization": false,
        "dataset_name": null,
        "dataset_subset": null,
        "dataset_size": 128,
        "dataset_split": null,
        "dataset_columns": null,
        "quantized_dtype": "w8a8",
        "quantized_algorithm": "normal",
        "quantized_method": "channel",
        "quantized_hybrid_level": 0,
        "quant_img_RGB2BGR": false,
        "auto_hybrid_cos_thresh": 0.98,
        "auto_hybrid_euc_thresh": null
      },
      "optimization": {
        "optimization_level": 0,
        "enable_flash_attention": false,
        "remove_weight": false,
        "compress_weight": false,
        "remove_reshape": false,
        "sparse_infer": false,
        "model_pruning": false
      }
    },
    "model_b2_s32.rknn": {
      "rktransformers_version": "0.2.0",
      "model_input_names": [
        "input_ids",
        "attention_mask"
      ],
      "batch_size": 2,
      "max_seq_length": 32,
      "task_kwargs": null,
      "float_dtype": "float16",
      "target_platform": "rk3588",
      "single_core_mode": false,
      "mean_values": null,
      "std_values": null,
      "custom_string": null,
      "inputs_yuv_fmt": null,
      "dynamic_input": null,
      "opset": 19,
      "task": "auto",
      "quantization": {
        "do_quantization": false,
        "dataset_name": null,
        "dataset_subset": null,
        "dataset_size": 128,
        "dataset_split": null,
        "dataset_columns": null,
        "quantized_dtype": "w8a8",
        "quantized_algorithm": "normal",
        "quantized_method": "channel",
        "quantized_hybrid_level": 0,
        "quant_img_RGB2BGR": false,
        "auto_hybrid_cos_thresh": 0.98,
        "auto_hybrid_euc_thresh": null
      },
      "optimization": {
        "optimization_level": 0,
        "enable_flash_attention": false,
        "remove_weight": false,
        "compress_weight": false,
        "remove_reshape": false,
        "sparse_infer": false,
        "model_pruning": false
      }
    },
    "model_b1_s32.rknn": {
      "rktransformers_version": "0.2.0",
      "model_input_names": [
        "input_ids",
        "attention_mask"
      ],
      "batch_size": 1,
      "max_seq_length": 32,
      "task_kwargs": null,
      "float_dtype": "float16",
      "target_platform": "rk3588",
      "single_core_mode": false,
      "mean_values": null,
      "std_values": null,
      "custom_string": null,
      "inputs_yuv_fmt": null,
      "dynamic_input": null,
      "opset": 19,
      "task": "auto",
      "quantization": {
        "do_quantization": false,
        "dataset_name": null,
        "dataset_subset": null,
        "dataset_size": 128,
        "dataset_split": null,
        "dataset_columns": null,
        "quantized_dtype": "w8a8",
        "quantized_algorithm": "normal",
        "quantized_method": "channel",
        "quantized_hybrid_level": 0,
        "quant_img_RGB2BGR": false,
        "auto_hybrid_cos_thresh": 0.98,
        "auto_hybrid_euc_thresh": null
      },
      "optimization": {
        "optimization_level": 0,
        "enable_flash_attention": false,
        "remove_weight": false,
        "compress_weight": false,
        "remove_reshape": false,
        "sparse_infer": false,
        "model_pruning": false
      }
    },
    "model_b4_s64.rknn": {
      "rktransformers_version": "0.2.0",
      "model_input_names": [
        "input_ids",
        "attention_mask"
      ],
      "batch_size": 4,
      "max_seq_length": 64,
      "task_kwargs": null,
      "float_dtype": "float16",
      "target_platform": "rk3588",
      "single_core_mode": false,
      "mean_values": null,
      "std_values": null,
      "custom_string": null,
      "inputs_yuv_fmt": null,
      "dynamic_input": null,
      "opset": 19,
      "task": "auto",
      "quantization": {
        "do_quantization": false,
        "dataset_name": null,
        "dataset_subset": null,
        "dataset_size": 128,
        "dataset_split": null,
        "dataset_columns": null,
        "quantized_dtype": "w8a8",
        "quantized_algorithm": "normal",
        "quantized_method": "channel",
        "quantized_hybrid_level": 0,
        "quant_img_RGB2BGR": false,
        "auto_hybrid_cos_thresh": 0.98,
        "auto_hybrid_euc_thresh": null
      },
      "optimization": {
        "optimization_level": 0,
        "enable_flash_attention": false,
        "remove_weight": false,
        "compress_weight": false,
        "remove_reshape": false,
        "sparse_infer": false,
        "model_pruning": false
      }
    }
  }
}